# 작업목록 [외주, 공정표]
>메뉴위치: 현장설정 > 협력업체 공사정보 > 작업목록 [외주, 공정표]


업체의 작업목록(공종)을 관리하거나 지하골조, 지상골조, 마감 각 공정표에 보여질 목록을 관리할 수 있습니다.

![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/01.png){width=600px}



## 협력업체 작업목록 등록

작업목록 이란, 해당 업체와 계약된 공종을 말합니다. 해당 업체가 공정표를 통하여 작업 및 출역을 관리하기 위해선 목록 생성이 필수 입니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/05.png){width=600px}

(예. 철근콘크리트공사 업체 작업 목록)


### 작업 목록 등록

업체에 추가하는 작업 목록은 현장에 미리 배정된 WBS를 이용하게 됩니다. 만약 원하는 WBS가 없을 경우 '현장WBS' 에 먼저 추가해 줍니다.

(각 현장 시스템관리자(공사주무, 공구장, 기사) 또는 MP지원팀 문의 필요)

업체가 시스템을 처음 사용할 때는 아래와 같이 아무런 목록이 없습니다. 업체의 계약 현황을 미리 확인하고 아래의 작업을 진행합니다. 


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/08.png){width=600px}

'협력업체 작업목록 등록' 영역의 우측 상단  ![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/행복사.png){height=25px} 버튼을 클릭 합니다.  


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/10.png){width=600px}

표 영역에서 **[C]** 표시가 된 행을 찾습니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/11.png)

찾은 행의 '소공종' 란 우측 ![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/그리드콤보버튼.png){width=30px} 버튼을 클릭하면 위와 같은 소공종 목록이 나오게 됩니다. 이 중 업체와 계약된 공종 하나를 선택 해줍니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/12.png)


이번엔 '단위작업' 란 우측  ![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/그리드콤보버튼.png){width=30px}  버튼을 클릭하여 나오는 목록 중 하나를 선택해 줍니다. 이 때 나오는 목록은 위에서 선택한 '방수공사' 소공종에 속한 '단위작업' 목록 입니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/13.png)

'정렬순서' 에 1, 2, 3... 입력할 경우 시스템 모든 화면에서 업체의 공종 목록을 보여줄 때 해당 순서로 나타나게 됩니다. 이 기능은 필수는 아닙니다.  

![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/저장.png){height=25px}  버튼을 클릭하여 업체 작업목록 등록을 완료 합니다. (저장 메시지 확인 클릭)

![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/저장메시지.png)



## 주간 공정표목록

각 분야(지하골조, 지상골조, 마감) 공정표에 보여질 목록을 관리할 수 있습니다. 업체의 작업목록을 다 합하면 몇 백개에 달하여 모두 보여주기에 불필요 하며, 공정 단계별로 주로 관리해야 하는 공종이 바뀌어야 하므로 이 목록을 별도로 관리하도록 만들어져 있습니다.

보여질 공종을 목록에 넣었다 뺐다 할수 있으며 순서도 조정 가능합니다. 이 때 업체가 기존에 등록한 자료는 안전하게 보관되므로 수시로 관리하여 원할한 공정 관리가 가능할 것입니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/16.png){width=600px}

(예. 지상골조 주간 공정표 목록)


### 주간 공정표목록 넣고 빼기

이 목록은 좌측 '협력업체 작업목록' 중에서 선택하게 됩니다. 업체별 작업목록을 조회하며 필요한 것을 이 목록으로 가져오는 방식입니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/04.png)

먼저 지하골조, 지상골조, 마감 셋 중 관리할 공사를 선택해 줍니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/19.png){width=600px}

'마감' 공사를 관리해 보겠습니다. 처음 시작할 때는 위와 같이 목록이 비어져 있습니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/18.png)

'협력업체 작업목록' 중 '공종' 을 클릭하여 업체를 선택해 줍니다. 위에서 선택한 '마감' 공사 중에 방수공사 업체를 선택하겠습니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/17.png){width=600px}

방수공사 업체의 작업목록이 조회 되었습니다. 그 중 첫번째 항목을 선택해 줍니다.


해당 작업을 우측으로 가져오기 위하여 **[>]** 버튼을 클릭해 줍니다. 참고로 **[>>]** 버튼은 전체 가져오기 입니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/20.png){width=600px}

업체의 작업목록을 공정표 목록으로 가져왔습니다. 더 이상 가져올 것이 없다면 ![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/저장.png){height=25px} 버튼을 클릭하여 저장해 줍니다.


### 주간 공정표 확인

이제 공정표로 이동하여 저장한 작업목록이 조회 되는지 확인해 보겠습니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/22.png)

일일공정(DPM)입력 > 공정 계획/실적 입력 > 마감공사  화면으로 이동 합니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/23.png)

마감공사 화면은 내부에 [동/공종별], [동 별], [공종 별] 세 개의 탭으로 구성되어 있습니다.

[공종 별] 탭으로 이동하여 ![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/검색.png){height=25px} 버튼을 누르면 아래와 같이 앞서 가져왔단 작업목록이 조회 됩니다.


![](file://C:/Users/H2001262/Pictures/MPLAN메뉴얼이미지/02_작업목록(외주,공정표)/21.png){width=600px}

(예. 마감공사 공종 별 공정표 작업목록 예시)
